<a href="https://colab.research.google.com/github/buzaev-fedor/project-from-ml-course/blob/master/HW_%E2%84%964.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Домашнее задание №4

В этом домашнем задании нам нужно закрепить основы SQL.

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
!pip install SQLAlchemy
!pip install mysql-connector-python
from sqlalchemy import create_engine

Requirement already satisfied: SQLAlchemy in /usr/local/lib/python3.6/dist-packages (1.3.17)
Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/d1/53/4cf90d2fe81b9cdb55dc180951bcec44ea8685665f1bdb1412501dc362dd/mysql_connector_python-8.0.20-cp36-cp36m-manylinux1_x86_64.whl (14.8MB)
     |████████████████████████████████| 14.8MB 307kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.10.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (47.1.1)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.20

In [ ]:
# импортируем библиотеку
from sqlalchemy import create_engine

In [ ]:
# создаем объект подключения, нужно поменять свой логин
sql = create_engine('mysql+mysqlconnector://user23:userpassword23@157.230.109.1/classicmodels_user23', pool_recycle=60)
connection = sql.connect()

In [ ]:
# отобразим доступные таблицы
pd.read_sql('Show tables;', connection).head()

  Tables_in_classicmodels_user23
0                       currtime
1              currtime_autoincr
2                      customers
3                      employees
4                        offices

# Задание

<img src="https://sp.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" alt="drawing" width="400"/>

## Задача №1 (1 балл)

Найти все Мустанги в таблице product

In [ ]:
df = pd.read_sql('''

SELECT *
FROM 
    products
WHERE
    productName LIKE '%Mustang%'

''', connection)
df

  productCode        productName  ... buyPrice    MSRP
0    S12_1099  1968 Ford Mustang  ...    95.34  194.57
1    S18_2581     P-51-D Mustang  ...    49.00   84.48

[2 rows x 9 columns]

## Задача №2 (2 балл)

Отобразить уникальных покупателей (его имя CustomerName) с суммой покупок, превышающей среднее значение суммы покупок

Отобразить все колонки таблицы payments за 2003 год, где сумма платежа больше среднего.

<img src="https://sp.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" alt="drawing" width="400"/>

In [ ]:
df = pd.read_sql('''

SELECT
    DISTINCT (c.customerName), SUM(p.amount) as 'сумма покупок'
FROM 
    customers c
LEFT JOIN
    payments p
ON
    c.customerNumber = p.customerNumber
GROUP BY c.customerName
HAVING SUM(p.amount) > (SELECT AVG(t.SUMM) 
                FROM
                  (SELECT SUM(p.amount) as SUMM
                  FROM payments as p
                  GROUP BY p.customerNumber) as t)
''', connection)
df

                    customerName  сумма покупок
0        Anna's Decorations, Ltd      137034.22
1     Australian Collectors, Co.      180585.07
2                 AV Stores, Co.      148410.09
3             Baane Mini Imports      104224.79
4       Corporate Gift Ideas Co.      132340.78
5     Corrida Auto Replicas, Ltd      112440.09
6       Danish Wholesale Imports      107446.50
7          Diecast Classics Inc.       98509.25
8     Down Under Souveniers, Inc      154622.08
9        Dragon Souveniers, Ltd.      156251.03
10        Euro+ Shopping Channel      715738.98
11               Gift Depot Inc.       95424.63
12              Handji Gifts& Co      105420.57
13                  Herkku Gifts       97562.47
14             Kelly's Gift Shop      114497.19
15             La Rochelle Gifts      116949.68
16             Land of Toys Inc.      107639.94
17          Marta's Replicas Co.       90545.37
18           Mini Creations Ltd.      101872.52
19  Mini Gifts Distributors Ltd.      584188.24
20            Muscle Machine Inc      177913.95
21  Online Diecast Creations Co.      116449.29
22       Oulu Toy Supplies, Inc.       95706.15
23            Reims Collectables      126983.19
24                 Rovelli Gifts      127529.69
25        Saveley & Henriot, Co.      130305.35
26     Souveniers And Things Co.       91655.61
27           Suominen Souveniers      103896.74
28          Technics Stores Inc.      104545.22
29       Tokyo Collectables, Ltd      105548.73
30          Toys of Finland, Co.       95546.46
31             Toys4GrownUps.com       93803.30
32               Vida Sport, Ltd      108777.92

## Задача №3 (3 балла)

Реализовать функцию, которая принимает на вход уникальные значения столбца таблицы, его название и название таблицы, а возвращает SQL запрос, который бы реализовал его кодирование на стороне sql.

В качестве уникальных значений используйте результат запроса к колонке productLine таблицы product. В качестве цифр для кодировки используйте индексы в полученном series объекте pandas-

<img src="https://sp.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" alt="drawing" width="400"/>

In [ ]:
df = pd.read_sql('''

SELECT 
    DISTINCT productLine 
FROM
    products

''', connection)

In [ ]:
def create_encoder(unique, columnname, tablename):
    return ('CASE' +
           ' '.join([f'\n    WHEN {columnname} = \'{i[1][0]}\' \n       THEN {i[0]}' 
                    for i in unique.iterrows()]) +
           f'\n    ELSE 0\nEND AS {columnname}_ENCODED \nFROM {tablename}')
print(create_encoder(df, 'productLine', 'products'))

CASE
    WHEN productLine = 'Classic Cars'
       THEN 0
    WHEN productLine = 'Motorcycles'
       THEN 1
    WHEN productLine = 'Planes'
       THEN 2
    WHEN productLine = 'Ships'
       THEN 3
    WHEN productLine = 'Trains'
       THEN 4
    WHEN productLine = 'Trucks and Buses'
       THEN 5
    WHEN productLine = 'Vintage Cars'
       THEN 6
    ELSE 0
END AS productLine_ENCODED
FROM products

In [ ]:
encoded_col = pd.read_sql('SELECT productLine, ' + create_encoder(df, 'productLine', 'products') + ' ORDER BY productCode', connection) 
encoded_col.head(5)

    productLine  productLine_ENCODED
0   Motorcycles                    1
1  Classic Cars                    0
2   Motorcycles                    1
3   Motorcycles                    1
4  Classic Cars                    0

In [ ]:
encoded_col.tail()

    productLine  productLine_ENCODED
105       Ships                    3
106       Ships                    3
107      Planes                    2
108      Planes                    2
109       Ships                    3

## Задача №4 (4 балла)

Создаем интерфейс предобработки данных на стороне SQL:

На основе решения задачи 3 реализовать функционал, который принимает на вход название таблицы, список названий релевантных (для некой целевой переменной) колонок и саму целевую колонку.

В нашем случае будем использовать таблицу products, колонки productLine, productScale, productVendor, quantityInStock, buyPrice, MSRP. Предположим, что предсказываем buyPrice (целевая колонка) на основе остальных столбцов.

Необходимо реализовать функционал, который анализирует тип данных каждой колонки (кроме целевой переменной), выбирает категориальные колонки (где несколько уникальных значений, на примере productLine) и создает закодированный датасет. Кодировщики хранятся в виде представлений для каждой колонки (например представлене, products_productLine_encodings).

Весь процесс должен проходить (по максимуму) на стороне sql. (Создание скрипта для кодировки данных можно взять немного модифицирировав функцию 3 задания).

<img src="https://sp.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png" alt="drawing" width="400"/>

In [ ]:
tablename = 'products'
df = (pd.read_sql(f'select * from {tablename}', connection))
df

    productCode                            productName  ... buyPrice    MSRP
0      S10_1678  1969 Harley Davidson Ultimate Chopper  ...    48.81   95.70
1      S10_1949               1952 Alpine Renault 1300  ...    98.58  214.30
2      S10_2016                  1996 Moto Guzzi 1100i  ...    68.99  118.94
3      S10_4698   2003 Harley-Davidson Eagle Drag Bike  ...    91.02  193.66
4      S10_4757                    1972 Alfa Romeo GTA  ...    85.68  136.00
..          ...                                    ...  ...      ...     ...
105   S700_3505                            The Titanic  ...    51.09  100.17
106   S700_3962                         The Queen Mary  ...    53.63   99.31
107   S700_4002              American Airlines: MD-11S  ...    36.27   74.03
108    S72_1253                       Boeing X-32A JSF  ...    32.77   49.66
109    S72_3212                             Pont Yacht  ...    33.30   54.60

[110 rows x 9 columns]

In [ ]:
def create_encoder3(tableName, targetCol, *relevantCol):
    columnname = list()
    for i in range(len(relevantCol)): 
        if len(pd.read_sql(f'SELECT DISTINCT {relevantCol[i]} from {tableName}', connection)) <= 10:  #выбираем категориальные колонки. Признаков не может быть много
            columnname.append(relevantCol[i])
        else:
            pass
    for i in columnname:   
        if pd.read_sql(f'SELECT {i} from {tableName}', connection).dtypes[0] != object:  #Проверка на тип данных, я добавляю в columnname те колонки, которые подходят по условию.
            columnname.remove(i)
        if columnname.count(targetCol) == 1:  #проверка, если целевая колонка попала в перечисление колонок, которые нужно закодировать.
            columnname.remove(targetCol)
        else:
            pass
    #Принцип бутерброда. Я создал глобальную переменную request, сложил из нее front + middle + back
    front = (f'SELECT DISTINCT ' + ', '.join([f'{columnname[n]}'for n in range(len(columnname))])) 
    middle = str()
    for i in range(len(columnname)):
        unique = pd.read_sql(f'SELECT DISTINCT {columnname[i]} from {tableName}', connection)
        caseReq = (('\n,CASE' + 
                                    ' '.join([f'\n    WHEN {columnname[i]} = \'{j[1][0]}\' \n       THEN {j[0]}' 
                                            for j in unique.iterrows()]) +
                                    f'\n    ELSE 0\nEND AS {columnname[i]}_ENCODED'))
        middle += caseReq #тело запросов с кейсами
    back = (f'\nFROM {tableName};')#конец запроса
    global request
    request = front + middle + back
    return request
(create_encoder3('products', 'buyPrice', 'productScale', 'productLine', 'productName','productVendor','productDescription','quantityInStock','buyPrice','MSRP'))
def to_pandas_from_sql(textRequest):
    df = pd.read_sql(f'{request}', connection)
    return df
to_pandas_from_sql(request)

   productScale       productLine  productScale_ENCODED  productLine_ENCODED
0          1:10       Motorcycles                     0                    1
1          1:10      Classic Cars                     0                    0
2          1:12      Classic Cars                     1                    0
3          1:12  Trucks and Buses                     1                    5
4          1:12       Motorcycles                     1                    1
5          1:18      Classic Cars                     2                    0
6          1:18  Trucks and Buses                     2                    5
7          1:18      Vintage Cars                     2                    6
8          1:18            Planes                     2                    2
9          1:72            Planes                     3                    2
10         1:18       Motorcycles                     2                    1
11         1:18             Ships                     2                    3
12         1:18            Trains                     2                    4
13         1:24      Classic Cars                     4                    0
14         1:24       Motorcycles                     4                    1
15         1:24            Planes                     4                    2
16         1:24      Vintage Cars                     4                    6
17         1:24             Ships                     4                    3
18         1:24  Trucks and Buses                     4                    5
19         1:32  Trucks and Buses                     5                    5
20         1:32       Motorcycles                     5                    1
21         1:32            Trains                     5                    4
22         1:32      Vintage Cars                     5                    6
23         1:50      Vintage Cars                     6                    6
24         1:50  Trucks and Buses                     6                    5
25         1:50            Trains                     6                    4
26         1:50       Motorcycles                     6                    1
27        1:700             Ships                     7                    3
28        1:700            Planes                     7                    2
29         1:72             Ships                     3                    3